test/solver/incompressibleVoF/cases/vofRow4Porous/0/porosity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      porosity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

// Per-cell, and all within (0, 1] — isoAdvection's constructor rejects a
// porosity outside that range.
internalField   nonuniform List<scalar>
4
(
1
0.75
0.5
0.25
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
